===================================
Basic Tag (no paragraph)
===================================
@span{Hello}
---

(document
  (p
    (tag
      (tag_name)
      (text)
    )))


===================================
Basic Tag with Attribute
===================================
@span[id=one name="my [name]"]{Hello}
---

(document
  (p
    (tag
      (tag_name)
      (attributes
        (attribute
          (attribute_name)
          (attribute_value))
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value))))
      (text))))


===================================
Tags with Text
===================================
This is @i{my} text: @span{Hello}!
---

(document
  (p
    (text)
    (tag
      (tag_name)
      (text))
    (text)
    (tag
      (tag_name)
      (text))
    (text)))

===================================
Text with Nested Tags
===================================
This is @span{my @i{nested} tag}.
---

(document
  (p
    (text)
    (tag
      (tag_name)
      (text)
      (tag
        (tag_name)
        (text))
      (text))
    (text)))
