===================================
Basic Tag (no paragraph)
===================================
@span{Hello}
---

(document
  (block
    (tag
      (name)
      (text)
    )))


===================================
Basic Tag with Attribute
===================================
@span[id=one name="my [name]"]{Hello}
---

(document
  (block
    (tag
      (name)
      (attributes
        (attribute
          (attribute_name)
          (attribute_value))
        (attribute
          (attribute_name)
          (attribute_value)))
      (text))))


===================================
Verbatim tag
===================================
My @v{first @i{test} tag}!
---

(document
  (block
    (text)
    (tag_verb)
    (text)))


===================================
Tags with Text
===================================
This is @i{my} text: @span{Hello}!
---

(document
  (block
    (text)
    (tag
      (name)
      (text))
    (text)
    (tag
      (name)
      (text))
    (text)))

===================================
Text with Nested Tags
===================================
This is @span{my @i{nested} tag}.
---

(document
  (block
    (text)
    (tag
      (name)
      (text)
      (tag
        (name)
        (text))
      (text))
    (text)))


===================================
Paragraphs with Tags
===================================
This is a document with multiple paragraphs.
This is the @i{first} paragraph.

This is the @b{second} paragraph.
It is also written over two lines.

This is my third paragraph.
---

(document
  (block
    (text)
    (tag
      (name)
      (text))
    (text))
  (block
    (text)
    (tag
      (name)
      (text))
    (text))
  (block
    (text)))


===================================
Basic Macro with Paragraphs
===================================
@title{My document}

This is my document with title @title.
---

(document
  (block
  
    (tag
      (name)
      (text)))
  (block
    (text)
    (macro
      (name))
    (text)))

