===================================
Basic Tag (no paragraph)
===================================
@span{Hello}
---

(document
  (p
    (tag
      (tag_name)
      (text)
    )))


===================================
Basic Tag with Attribute
===================================
@span[id=one name="my [name]"]{Hello}
---

(document
  (p
    (tag
      (tag_name)
      (attributes
        (attribute
          (attribute_name)
          (attribute_value))
        (attribute
          (attribute_name)
          (attribute_value)))
      (text))))


===================================
Verbatim tag
===================================
My @v{first @i{test} tag}!
---

(document
  (p
    (text)
    (tag_verb)
    (text)))


===================================
Tags with Text
===================================
This is @i{my} text: @span{Hello}!
---

(document
  (p
    (text)
    (tag
      (tag_name)
      (text))
    (text)
    (tag
      (tag_name)
      (text))
    (text)))

===================================
Text with Nested Tags
===================================
This is @span{my @i{nested} tag}.
---

(document
  (p
    (text)
    (tag
      (tag_name)
      (text)
      (tag
        (tag_name)
        (text))
      (text))
    (text)))


===================================
Paragraphs with Tags
===================================
This is a document with multiple paragraphs.
This is the @i{first} paragraph.

This is the @b{second} paragraph.
It is also written over two lines.

This is my third paragraph.
---

(document
  (p
    (text)
    (tag
      (tag_name)
      (text))
    (text))
  (p
    (text)
    (tag
      (tag_name)
      (text))
    (text))
  (p
    (text)))


===================================
Basic Variable
===================================
@title: My document
---
(document
  (p
    (var
      (tag_name)
      (text)
      )))


===================================
Basic Variable with Paragraphs
===================================
@title: My document

This is my document with title @title.
---
(document
  (p
    (var
      (tag_name)
      (text)
      )))


===================================
Basic Headings (Multiple)
===================================
@author: J Lorieau
@H2O: H@sup{2}O
@toc {
  @next{file1.txt}
  @prev{file2.txt}
}

(document
  (p
    (var
      (tag_name))
    (text)
    (var
      (tag_name))
    (text)
    (tag
      (tag_name)
      (text))
    (text)
    (tag
      (tag_name)
      (text)
      (tag
        (tag_name)
        (text))
      (text)
      (tag
        (tag_name)
        (text)))))
